Repository: Jpwaters09/File-Converter
Catalog: File Converter/Strings/*/Resources.resw
Source language: en_ca
Languages: ar, bn, es, it, ja, uk

# AppTitle.Text
source: File Converter
ar: محول الملفات
bn: ফাইল রূপান্তরকারী
es: Convertidor de archivos
it: Convertitore di file
ja: ファイルコンバーター
uk: Конвертер файлів

# ConvertFromComboBox.Header
source: Convert From
ar: التحويل من
bn: রূপান্তর করুন
es: Convertir desde
it: Converti da
ja: 変換元
uk: Конвертувати з

# ConvertFromComboBox.PlaceholderText
source: Select source file format
ar: حدد تنسيق ملف المصدر
bn: উৎস ফাইলের ফরম্যাট নির্বাচন করুন
es: Seleccione el formato del archivo de origen.
it: Seleziona il formato del file sorgente
ja: ソースファイル形式を選択してください
uk: Виберіть формат вихідного файлу

# ConvertFromItemPlaceholder.Content
source: Select source file format
ar: حدد تنسيق ملف المصدر
bn: উৎস ফাইলের ফরম্যাট নির্বাচন করুন
es: Seleccione el formato del archivo de origen.
it: Seleziona il formato del file sorgente
ja: ソースファイル形式を選択してください
uk: Виберіть формат вихідного файлу

# ConvertToComboBox.Header
source: Convert To
ar: التحويل إلى
bn: রূপান্তর করুন
es: Convertir a
it: Converti in
ja: 変換する
uk: Конвертувати в

# ConvertToComboBox.PlaceholderText
source: Select output file format
ar: اختر تنسيق ملف الإخراج
bn: আউটপুট ফাইলের ফরম্যাট নির্বাচন করুন
es: Seleccione el formato del archivo de salida.
it: Seleziona il formato del file di output
ja: 出力ファイル形式を選択してください
uk: Виберіть формат вихідного файлу

# ConvertToItemPlaceholder.Content
source: Select output file format
ar: اختر تنسيق ملف الإخراج
bn: আউটপুট ফাইলের ফরম্যাট নির্বাচন করুন
es: Seleccione el formato del archivo de salida.
it: Seleziona il formato del file di output
ja: 出力ファイル形式を選択してください
uk: Виберіть формат вихідного файлу

# FileLocationsTextBlock.Text
source: File Locations
ar: مواقع الملفات
bn: ফাইলের অবস্থান
es: Ubicaciones de los archivos
it: Posizioni dei file
ja: ファイルの場所
uk: Розташування файлів

# FileTypeComboBox.Header
source: File Type
ar: نوع الملف
bn: ফাইলের ধরন
es: Tipo de archivo
it: Tipo di file
ja: ファイルの種類
uk: Тип файлу

# FileTypeComboBox.PlaceholderText
source: Select file type
ar: حدد نوع الملف
bn: ফাইলের ধরন নির্বাচন করুন
es: Seleccione el tipo de archivo
it: Seleziona il tipo di file
ja: ファイルの種類を選択してください
uk: Виберіть тип файлу

# FileTypeItemImage.Content
source: Image
ar: صورة
bn: ছবি
es: Imagen
it: Immagine
ja: 画像
uk: Зображення

# FileTypeItemPlaceholder.Content
source: Select file type
ar: حدد نوع الملف
bn: ফাইলের ধরন নির্বাচন করুন
es: Seleccione el tipo de archivo
it: Seleziona il tipo di file
ja: ファイルの種類を選択してください
uk: Виберіть тип файлу

# HomeNavViewItem.Content
source: Home
ar: بيت
bn: হোম
es: Hogar
it: Casa
ja: 家
uk: Дім

# HomeNavViewItem.ToolTipService.ToolTip
source: Home
ar: بيت
bn: হোম
es: Hogar
it: Casa
ja: 家
uk: Дім

# OutputFolderPathBox.PlaceholderText
source: Select output file folder
ar: حدد مجلد ملف الإخراج
bn: আউটপুট ফাইল ফোল্ডার নির্বাচন করুন
es: Seleccione la carpeta de archivos de salida.
it: Selezionare la cartella del file di output
ja: 出力ファイルフォルダを選択してください
uk: Виберіть папку вихідних файлів

# SourceFilePathBox.PlaceholderText
source: Select source file path
ar: حدد مسار ملف المصدر
bn: উৎস ফাইলের পথ নির্বাচন করুন
es: Seleccione la ruta del archivo de origen
it: Seleziona il percorso del file sorgente
ja: ソースファイルパスを選択してください
uk: Виберіть шлях до вихідного файлу

# FileSelectorButton.Content
source: Select
ar: يختار
bn: নির্বাচন করুন
es: Seleccionar
it: Selezionare
ja: 選択
uk: Виберіть

# TitleBar.Title
source: File Converter
ar: محول الملفات
bn: ফাইল রূপান্তরকারী
es: Convertidor de archivos
it: Convertitore di file
ja: ファイルコンバーター
uk: Конвертер файлів

# OutputSettingsTextBlock.Text
source: Output Settings
ar: إعدادات الإخراج
bn: আউটপুট সেটিংস
es: Configuración de salida
it: Impostazioni di output
ja: 出力設定
uk: Налаштування виводу

# OutputQualityTextBlock.Text
source: Output Quality
ar: جودة المخرجات
bn: আউটপুট গুণমান
es: Calidad de salida
it: Qualità dell'output
ja: 出力品質
uk: Якість виводу

# IconSizeTitle.Text
source: Icon Size
ar: حجم الأيقونة
bn: আইকনের আকার
es: Tamaño del icono
it: Dimensione icona
ja: アイコンサイズ
uk: Розмір значка

# IconSizeItem.Content
source: ICO for Windows
ar: ICO لنظام التشغيل Windows
bn: উইন্ডোজের জন্য আইসিও
es: ICO para Windows
it: ICO per Windows
ja: Windows用ICO
uk: ICO для Windows

# StripMetadataCheckBox.Content
source: Strip Metadata
ar: إزالة البيانات الوصفية
bn: মেটাডেটা স্ট্রিপ করুন
es: Eliminar metadatos
it: Metadati della striscia
ja: メタデータの削除
uk: Вилучити метадані

# ConvertButton.Content
source: Convert
ar: يتحول
bn: রূপান্তর করুন
es: Convertir
it: Convertire
ja: 変換する
uk: Конвертувати

# SettingsTitleText.Text
source: Settings
ar: إعدادات
bn: সেটিংস
es: Ajustes
it: Impostazioni
ja: 設定
uk: Налаштування

# AppearanceTextBlock.Text
source: Appearance
ar: مظهر
bn: চেহারা
es: Apariencia
it: Aspetto
ja: 外観
uk: Зовнішній вигляд

# AppThemeTextBlock.Text
source: App Theme
ar: سمة التطبيق
bn: অ্যাপ থিম
es: Tema de la aplicación
it: Tema dell'app
ja: アプリテーマ
uk: Тема програми

# SelectAppThemeTextBlock.Text
source: Select which app theme to display
ar: اختر سمة التطبيق التي تريد عرضها
bn: কোন অ্যাপ থিমটি প্রদর্শন করতে হবে তা নির্বাচন করুন
es: Seleccione qué tema de la aplicación desea mostrar
it: Seleziona il tema dell'app da visualizzare
ja: 表示するアプリのテーマを選択してください
uk: Виберіть тему програми для відображення

# SystemSettingComboBoxItem.Content
source: Use system setting
ar: استخدم إعدادات النظام
bn: সিস্টেম সেটিং ব্যবহার করুন
es: Utilice la configuración del sistema
it: Utilizzare le impostazioni di sistema
ja: システム設定を使用する
uk: Використати системні налаштування

# LightSettingComboBoxItem.Content
source: Light
ar: ضوء
bn: আলো
es: Ligero
it: Leggero
ja: ライト
uk: Світло

# DarkSettingComboBoxItem.Content
source: Dark
ar: مظلم
bn: অন্ধকার
es: Oscuro
it: Buio
ja: 暗い
uk: Темний

# AboutTextBlock.Text
source: About
ar: عن
bn: সম্পর্কে
es: Acerca de
it: Di
ja: について
uk: Про нас

# CopyrightTextBlock.Text
source: © 2026 Jacob Waters. All rights reserved.
ar: © 2026 جاكوب ووترز. جميع الحقوق محفوظة.
bn: © ২০২৬ জ্যাকব ওয়াটার্স। সর্বস্বত্ব সংরক্ষিত।
es: © 2026 Jacob Waters. Todos los derechos reservados.
it: © 2026 Jacob Waters. Tutti i diritti riservati.
uk: © 2026 Джейкоб Вотерс. Усі права захищено.

# DeveloperTextBlock.Text
source: Developer
ar: مطور
bn: ডেভেলপার
es: Desarrollador
it: Sviluppatore
ja: 開発者
uk: Розробник

# NameTextBlock.Text
source: Jacob Waters
ar: جاكوب ووترز
bn: জ্যাকব ওয়াটার্স
ja: ジェイコブ・ウォーターズ
uk: Джейкоб Вотерс

# BugRequestTextBlock.Text
source: File a bug or request
ar: أبلغ عن مشكلة أو طلب
bn: একটি ত্রুটি বা অনুরোধ জানান
es: Informar de un error o hacer una solicitud
it: Segnala un bug o invia una richiesta
ja: バグ報告またはリクエスト
uk: Повідомити про помилку або повідомити про запит

# ContactTextBlock.Text
source: Contact Me
ar: تواصل معي
bn: আমার সাথে যোগাযোগ করুন
es: Contáctame
it: Contattami
ja: 連絡する
uk: Зв'яжіться зі мною

# LinksAndSocialsTextBlock.Text
source: Links & Socials
ar: الروابط ووسائل التواصل الاجتماعي
bn: লিঙ্ক এবং সামাজিক মাধ্যম
es: Enlaces y redes sociales
it: Link e social
ja: リンクとソーシャルメディア
uk: Посилання та соціальні мережі

# WebsiteText.Content
source: Website
ar: موقع إلكتروني
bn: ওয়েবসাইট
es: Sitio web
it: Sito web
ja: Webサイト
uk: Вебсайт

# LicenceText.Content
source: License
ar: رخصة
bn: লাইসেন্স
es: Licencia
it: Licenza
ja: ライセンス
uk: Ліцензія

# PrivacyPolicyText.Content
source: Privacy Policy
ar: سياسة الخصوصية
bn: গোপনীয়তা নীতি
es: política de privacidad
it: politica sulla riservatezza
ja: プライバシーポリシー
uk: Політика конфіденційності

# SourceCodeText.Content
source: Source Code
ar: شفرة المصدر
bn: উৎস কোড
es: Código fuente
it: Codice sorgente
ja: ソースコード
uk: Вихідний код

# FirstLaunchDialogTitle
source: Welcome to File Converter
ar: مرحباً بك في محول الملفات
bn: ফাইল কনভার্টারে আপনাকে স্বাগতম
es: Bienvenido a File Converter
it: Benvenuti in File Converter
ja: ファイルコンバーターへようこそ
uk: Ласкаво просимо до Конвертера файлів

# FirstLaunchDialogContent
source: Thanks for purchasing File Converter. Please consider following me for updates, previews, and more.
ar: شكراً لشرائك برنامج تحويل الملفات. يُرجى متابعتي للحصول على التحديثات والمعاينات والمزيد.
bn: ফাইল কনভার্টার কেনার জন্য ধন্যবাদ। আপডেট, প্রিভিউ এবং আরও অনেক কিছুর জন্য আমাকে ফলো করতে পারেন।
es: Gracias por adquirir File Converter. Por favor, considera seguirme para recibir actualizaciones, avances y más.
it: Grazie per aver acquistato File Converter. Vi invito a seguirmi per ricevere aggiornamenti, anteprime e altro ancora.
ja: ファイルコンバーターをご購入いただきありがとうございます。 最新情報やプレビューなどをご覧になりたい方は、ぜひ私をフォローしてください。
uk: Дякуємо за придбання Конвертера файлів. Будь ласка, підпишіться на мене, щоб отримувати оновлення, попередній перегляд тощо.

# FirstLaunchDialogPrimaryButtonText
source: Follow & Support
ar: تابع وادعم
bn: অনুসরণ করুন ও সমর্থন করুন
es: Síguenos y apóyanos
it: Segui e sostieni
ja: フォロー＆サポート
uk: Підпишіться та підтримайте

# FirstLaunchDialogSecondaryButtonText
source: Contact Me
ar: تواصل معي
bn: আমার সাথে যোগাযোগ করুন
es: Contáctame
it: Contattami
ja: 連絡する
uk: Зв'яжіться зі мною

# FirstLaunchDialogCloseButtonText
source: Get Started
ar: ابدأ الآن
bn: শুরু করুন
es: Comience
it: Inizia subito
ja: さあ始めましょう
uk: Почати

# RatingDialogTitle
source: Are you enjoying this app?
ar: هل تستمتع باستخدام هذا التطبيق؟
bn: আপনি কি এই অ্যাপটি উপভোগ করছেন?
es: ¿Te está gustando esta aplicación?
it: Ti piace questa app?
ja: このアプリは楽しんでいますか？
uk: Вам подобається цей додаток?

# RatingDialogContent
source: Your feedback helps improve this app. Would you like to rate it or share your thoughts?
ar: تساعدنا ملاحظاتكم في تحسين هذا التطبيق. هل ترغبون بتقييمه أو مشاركة أفكاركم؟
bn: আপনার মতামত এই অ্যাপটিকে আরও উন্নত করতে সাহায্য করে। আপনি কি এটিকে রেটিং দিতে বা আপনার ভাবনা জানাতে চান?
es: Tus comentarios nos ayudan a mejorar esta aplicación. ¿Te gustaría valorarla o compartir tu opinión?
it: Il tuo feedback ci aiuta a migliorare questa app. Vuoi valutarla o condividere le tue opinioni?
ja: 皆様からのフィードバックは、このアプリの改善に役立ちます。評価やご意見をお聞かせいただけますか？
uk: Ваш відгук допомагає покращити цей додаток. Бажаєте оцінити його або поділитися своїми думками?

# RatingDialogPrimaryButtonText
source: Rate app
ar: قيّم التطبيق
bn: অ্যাপটি রেট করুন
es: Califica la aplicación
it: Valuta l'app
ja: アプリを評価する
uk: Оцініть додаток

# RatingDialogSecondaryButtonText
source: Report an issue
ar: الإبلاغ عن مشكلة
bn: একটি সমস্যা রিপোর্ট করুন
es: Informar de un problema
it: Segnala un problema
ja: 問題を報告する
uk: Повідомити про проблему

# RatingDialogCloseButtonText
source: Later
ar: لاحقاً
bn: পরে
es: Más tarde
it: Dopo
ja: 後で
uk: Пізніше

# FinishedDialogTitle
source: Converted '{0}{1}' to '{0}.{2}'
ar: تم تحويل الملف '{0}{1}' إلى الملف '{0}.{2}'
bn: '{0}{1}' কে '{0}.{2}'-তে রূপান্তর করা হয়েছে
es: Convertido '{0}{1}' a '{0}.{2}'
it: Convertito '{0}{1}' in '{0}.{2}'
ja: '{0}{1}'を'{0}.{2}'に変換しました
uk: Конвертовано '{0}{1}' на '{0}.{2}'

# FinishedDialogCloseButtonText
source: OK
ar: نعم
bn: ঠিক আছে
es: DE ACUERDO
ja: わかりました
uk: Гаразд

# ErrorDialogTitle
source: Error Converting Image
ar: خطأ في تحويل الصورة
bn: ছবি রূপান্তর করতে ত্রুটি
es: Error al convertir la imagen
it: Errore durante la conversione dell'immagine
ja: 画像の変換エラー
uk: Помилка конвертації зображення

# ErrorDialogPrimaryButtonText
source: Copy Error
ar: خطأ في النسخ
bn: কপি ত্রুটি
es: Error de copia
it: Errore di copia
ja: コピーエラー
uk: Помилка копіювання

# ErrorDialogCloseButtonText
source: OK
ar: نعم
bn: ঠিক আছে
es: DE ACUERDO
ja: わかりました
uk: Гаразд
